The bar cannot be bent in that shape. Check the bending diameter and the bar type.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId CantMakeFillets { get; }
  Visual Basic
Public Shared ReadOnly Property CantMakeFillets As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CantMakeFillets {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarFailures Class
  Autodesk.Revit.DB Namespace